app/Models/LaporanModel.php

    public function getTotalPendapatan()
    {
        try {
            $query = $this->db->table('data_penjualan')->selectSum('hargaTotal')->get();
---
SELECT SUM(`hargaTotal`) AS `hargaTotal`
FROM `data_penjualan`